n = -10:10;

% Για το χ1, βάζουμε τα σημεία που ξέρουμε για τις διακριτές τιμές του ν
% στη συνέχεια βάζουμε 0 αλλού 
x1 = zeros(size(n));
x1(n >= 0 & n <= 4) = [2, 2, 3, 3, 4];
x2 = heaviside(n) - heaviside(n-6);
a = 4;
b = 5;

% Υπολογίζουμε τα y1, y2
y1 = 4 .* (n.^2) .* x1;
y2 = 4 .* (n.^2) .* x2;

% Υπολογίζουμε το πρώτο μέρος
y_final1 = a .* y1 + b .* y2;

% Υπολογίζουμε το δεύτερο μέρος
y_final2 = 4 .* (n.^2) .* (a .* x1 + b .* x2);

% τα βάζουμε το ένα κάτω απ το άλλο για εύκολη σύγκριση 
subplot(2,1,1);
stem(n, y_final);
title('Response');

subplot(2,1,2);
stem(n, y_final2);
title('Response to Combined Input');
